Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: You can also go the other direction, and write your main program in C or C++, and then link in some Perl code on the fly, to create a powerful application.
es_es: También puede optar por trabajar en sentido contrario: desarrollar el programa principal en C o C++, y después vincular código Perl sobre la marcha para crear una aplicación eficaz.

source: In addition to interacting with the C<(*SKIP)> pattern, C<(*MARK:NAME)> can be used to "label" a pattern branch, so that after matching, the program can determine which branches of the pattern were involved in the match.
es_es: Además de interactuar con el patrón C<(*SKIP)>, C<(*MARK:NOMBRE)> puede ser usado para "marcar" una rama de del patrón, para que después de la búsqueda, el programa puede determinar qué ramas del patrón participaron en la coincidencia.

source: But benchmarks indicated that for some inputs, on some platforms, the original quicksort was faster.
es_es: Pero los benchmarks indicaron que, para algunas entradas, en algunas plataformas, el quicksort original era más rápido.

source: Production releases, which incorporate bug fixes and new functionality, are widely tested before release.
es_es: Las versiones de producción, que incorporan correcciones de errores y funcionalidad nueva, se someten a pruebas intensivas antes de su lanzamiento.

source: Note that if your forked child inherits system file descriptors like STDIN and STDOUT that are actually connected by a pipe or socket, even if you exit, then the remote server (such as, say, a CGI script or a backgrounded job launched from a remote shell) won't think you're done.
es_es: Note que si su hijo hereda los descriptores de archivo del sistema como STDIN y STDOUT que estén conectados a un pipe o a un socket, incluso si usted sale del programa, el servidor remoto (por ejemplo, un script CGI o un proceso lanzado en segundo plano desde un shell remoto) no se dará cuenta de que se ha ido.

source: Perl tries to be all things to all people, but nothing special to anyone.
es_es: Perl trata de cubrir todas las necesidades, en lugar de limitarse a fines específicos.

source: Which of these modifiers is in effect at any given point in a regular expression depends on a fairly complex set of interactions.
es_es: Cuáles de estos modificares están activos en un determinado punto de una expresión regular depende de un conjunto muy complejo de interacciones.

source: allow building perl with -DUSE_UTF8_SCRIPTS which makes UTF-8 the default script encoding (not the default since that would break all scripts having legacy eight-bit data in them)
es_es: permitir la construcción de perl con -DUSE_UTF8_SCRIPTS que hace que sea la codificación UTF-8 la de por defecto en el codificado de los script (no está por defecto ya que rompería todos los script que tiene un legado de ocho bits de datos dentro de si)

source: Most of these books are available online through Safari Books Online ( http://safaribooksonline.com/ ).
es_es: La mayoría de estos libros están disponibles en línea a través de Safari Books Online ( http://safaribooksonline.com/ ).

source: See the section on C<use VERSION> of L<perlfunc/require> for details.
es_es: Vea la sección C<use VERSION> de L<perlfunc/require> para más detalles.

source: I consider linking in C subroutines in this manner to be the moral equivalent of defining subroutines in the Perl language itself.
es_es: Considero que el enlazado de las subrutinas en C, de esta manera, sean moralmente equivalentes a las definiciones de subrutinas en el propio lenguaje Perl.

source: perlintro -- a brief introduction and overview of Perl
es_es: perlintro -- Breve introducción y descripción general de Perl

source: It's ultimately up to you (and possibly your management) which tasks you'll use Perl for and which you won't.
es_es: En última instancia, el usuario (y posiblemente sus jefes) deberán decidir para qué tareas pueden usar Perl, y para cuáles no.

source: =item Scalars
es_es: =item Escalares

source: You are responsible for ensuring that the string is not a temporary value, as that could potentially get deallocated before you got around to using the packed result.
es_es: Usted es responsable de asegurarse que la cadena no es un valor temporal, ya que podría quedar desasignado antes de poder usar el resultado empaquetado.

source: =head2 New Or Improved Platforms
es_es: =head2 Nuevas o mejoras plataformas

source: The auto-increment operator has a little extra builtin magic to it.
es_es: El operador de auto incremento tiene un poco más de magia en él.

source: d A double-precision float in native format.
es_es: d Un flotante en doble precisión en formato nativo.

source: Just "outdent" it a little to make it more visible:
es_es: Sólo "desángrelo" un poco para hacerlo más visible:

source: # a struct utmp (BSDish)
es_es: # una struct utmp (del BSD)

source: C<autouse> upgraded to version 1.05
es_es: C<autouse> actualizado a la versión 1.05

source: printf '<%#10.6x>', 1; # prints "< 0x000001>"
es_es: printf '<%#10.6x>', 1; # imprime "< 0x000001>"

source: The C<P> format packs a pointer to a structure of the size indicated by the length.
es_es: El formato C<P> empaqueta un puntero a una estructura del tamaño indicado por la longitud.

source: FILEHANDLE may be a scalar variable containing the name of or a reference to the filehandle, thus introducing one level of indirection.
es_es: IDENTIFICADOR_ARCHIVO puede ser una variable escalar conteniendo el nombre de o una referencia al identificador de archivo, introduciendo así un nivel más de indirección.

source: A space or a newline is now required after a C<"#line XXX"> directive.
es_es: Ahora se requiere un espacio o una nueva línea después de una directiva C<"#line XXX">.

source: If you want to learn the basics of Perl, you might start with the Llama book, which assumes that you already know a little about programming:
es_es: Si desea aprender los conceptos básicos de Perl, puede empezar por el Libro de la Llama, cuya lectura requiere unos conocimientos mínimos de programación:

source: =item binmode FILEHANDLE, LAYER X<binmode> X<binary> X<text> X<DOS> X<Windows>
es_es: =item binmode IDENTIFICADOR_ARCHIVO, CAPA X<binmode> X<binary> X<text> X<DOS> X<Windows> X<binario> X<texto>

source: The most well known of these is C<%ENV> which contains environment variables.
es_es: El más conocido es C<%ENV>, que contiene variables de entorno.

source: @articles = sort {$b cmp $a} @files;
es_es: @articulos = sort {$b cmp $a} @archivos;

source: make split()'s unused captures to be undef, not ''
es_es: hacer que las capturas no utilizadas de split() sean indefinidas, no ''

source: a A string with arbitrary binary data, will be null padded.
es_es: a Una cadena con datos binarios arbitrarios, serán rellenados con nulos.

source: /(?:(?s-i)more.*than).*million/i
es_es: /(?:(?s-i)más.*que).*millones/i

source: As C<\c> is skipped at this step, C<@> of C<\c@> in RE is possibly treated as an array symbol (for example C<@foo>), even though the same text in C<qq//> gives interpolation of C<\c@>.
es_es: Como C<\c> es omitido en este paso, C<@> de C<\c@> en RE es posiblemente tratado como un símbolo de array (por ejemplo C<@foo>), incluso aunque el mismo texto en C<qq//> sí da la interpolación de C<\c@>.

source: To view the differences between the 5.7.1 release and the 5.7.2 release, see L<perl572delta>.)
es_es: (Para ver las diferencias entre la versión 5.7.1 y la versión 5.7.2, vea L<perl572delta>).

source: Here are Perl's functions (including things that look like functions, like some keywords and named operators) arranged by category.
es_es: Aquí están las funciones Perl (incluyen cosas que parecen funciones, como algunas palabras clave y operadores con nombre) agrupados por categoría.

source: Until the block exits, elements locally deleted temporarily no longer exist.
es_es: Hasta que un bloque termine, los elementos locales suprimidos, temporalmente, ya no existen.

source: Thus arrays and hashes lose their identity in a LIST--the list
es_es: Así, los arrays y hashes pierden su identidad en una LISTA: la lista

source: With it, one can write C<\d> with confidence that it will only match ASCII characters, and should the need arise to match beyond ASCII, you can use C<\p{Digit}>, or C<\p{Word}> for C<\w>.
es_es: Con él, se puede escribir C<\d> con la confianza de que sólo coincidirá con caracteres ASCII, y en caso de necesidad, para que coincida más allá del ASCII, puede usar C<\p{Digit}>, o C<\p{Word}> en lugar de C<\w>.

source: When called in scalar context, returns only the key (not the value) in a hash, or the index in an array.
es_es: Cuando se le llama en contexto escalar, sólo devuelve la clave (no el valor) del hash, o el índice del array.

source: For C<unpack>, an internal stack of integer arguments unpacked so far is used.
es_es: Para C<unpack>, se usa una pila interna de argumentos enteros desempaquetados.

source: Unsupported in lookbehind.
es_es: No soportado en búsquedas de coincidencias previas.

source: If SUBNAME or BLOCK is omitted, C<sort>s in standard string comparison order.
es_es: Si NOMBRE_SUB O BLOQUE se omite, se ordena siguiendo una comparación estándar de cadenas de caracteres.

source: =item Operators which expect a string
es_es: =item Operadores que consumen una cadena

source: The first block or so of the file is examined for odd characters such as strange control codes or characters with the high bit set.
es_es: El primer bloque (aprox.) del archivo, es examinado para buscar caracteres extraños como códigos de control o caracteres con el bit alto puesto.

source: Arguments should be integers.
es_es: Los argumentos deben ser números enteros.

source: You can override the width by putting a number here, or get the width from the next argument (with C<*>) or from a specified argument (e.g., with C<*2$>):
es_es: Puede reemplazar el ancho al anteponer un número, u obteniendo la anchura del siguiente argumento (con C<*>) o de un argumento determinado (por ejemplo, con C<*2$>):

source: The first argument of the list will be interpreted as the C<printf> format.
es_es: El primer argumento de la lista será interpretado como el formato para C<printf>.

source: Configurable error handling can be very useful to your users.
es_es: Una gestión configurable de errores puede ser muy útil para los usuarios.

source: C<Cwd> upgraded to version 3.12
es_es: C<Cwd> actualizado a la versión 3.12

source: As of Perl 5.10.1 there is a new interface for plugging and using method resolution orders other than the default (linear depth first search).
es_es: A partir de Perl 5.10.1 existe una nueva interfaz para la conexión y orden del método de resolución aparte del predeterminado (buscar primero en profundidad lineal).

source: =item Boolean logic
es_es: =item Lógica Booleana

# } until $line eq ". ";
source: } until $line eq ".\n";
es_es: } until $linea eq ".\n";

source: push @{ $AoA[0] }, "wilma", "betty"; # explicit deref
es_es: push @{ $AoA[0] }, "wilma", "betty"; # desreferencia explícita

source: (Note that C<$(>, C<$)>, and C<$|> are not interpolated because they look like end-of-string tests.) Perl will not recompile the pattern unless an interpolated variable that it contains changes.
es_es: (Tenga en cuenta que C<$(>, C<$)>, y C<$|> no son interpolados porque tienen la apariencia de test de final-de-cadena). Perl no recompilará el patrón a menos que cambie una variable que vaya a ser interpolada.

source: If VALUE is omitted, uses C<$_>.
es_es: Si se omite VALOR, se usa C<$_>.

source: Documentation tweaks
es_es: Ajustes en la documentación

source: While the GNU project includes Perl in its distributions, there's no such thing as "GNU Perl".
es_es: Aunque el proyecto GNU incluye Perl en sus distribuciones, no existe "GNU Perl".

source: 11 blksize preferred block size for file system I/O
es_es: 11 blksize tamaño preferido del bloque de E/S para el sistema de archivos

source: AUTHOR
es_es: AUTOR

source: $hours = $1;
es_es: $horas = $1;

source: is the same as this:
es_es: es lo mismo que:

source: These are run first in the test suite and if any of them fail, something is I<really> broken.
es_es: Son las primeras que se ejecutan del conjunto de pruebas; si no se supera alguna de estas pruebas, significa que hay un problema grave.

source: See L<perlfunc/hex> and L<perlfunc/oct> for more details.
es_es: Vea L<perlfunc/hex> y L<perlfunc/oct> para más detalles.

source: Calls the System V IPC function semop(2) for semaphore operations such as signalling and waiting.
es_es: Llama a la función System V IPC semop(2) para operaciones de semáforo como señalización y espera.

source: print "Hello, world";
es_es: print "Hola a todos";

source: In other words, the C<foreach> loop index variable is an implicit alias for each item in the list that you're looping over.
es_es: En otras palabras, la variable índice del bucle C<foreach> es implícitamente un alias de cada elemento de la lista sobre la que está iterando.

source: my $perm = (stat $fh)[2] & 07777;
es_es: my $permisos = (stat $fh)[2] & 07777;

source: enhanced debugger and interactive Perl environment, with integrated editor support
es_es: depurador mejorado y entorno Perl interactivo, compatible con un editor integrado

source: It is also useful when writing C<lex>-like scanners, when you have several patterns that you want to match against consequent substrings of your string; see the previous reference.
es_es: También es útil cuando se escriben escáneres C<lex>, cuando tiene varios patrones que desea hacer coincidir contra consiguientes subcadenas de su cadena; vea la referencia anterior.

source: However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.
es_es: Sin embargo, usted puede distribuir este Paquete en conjunto con otros programas (posiblemente comerciales) como parte de una mayor (posiblemente comercial) distribución de software siempre y cuando no haga publicidad de este Paquete como si fuera un producto suyo.

source: (This can happen if the group is optional, or in a different branch of an alternation.) You can omit the C<"g">, and write C<"\1">, etc, but there are some issues with this form, described below.
es_es: (Esto puede ocurrir si el grupo es opcional, o en una rama diferente de una alternancia.) Puede omitir la C<"g">, y escribir C<"\1">, etc, pero hay algunos problemas con este formato, como se describe más abajo.

source: Mentioning the ternary operator in this error message makes it easier to diagnose syntax errors.
es_es: Al mencionar el operador ternario en este mensaje de error hace que sea más fácil diagnosticar errores de sintaxis.

source: line-noise lowercase line-noise lowercase line-noise lowercase
es_es: línea-ruido minúsculas línea-ruido minúsculas línea-ruido minúsculas

source: Returns the file descriptor for a filehandle, or undefined if the filehandle is not open.
es_es: Devuelve el descriptor de archivo para un identificador de archivo, o indefinido si el identificador de archivo no está abierto.

source: Those systems that implement a proprietary shadow password facility are unlikely to be supported.
es_es: Los sistemas que implementen un sistema de contraseñas shadow propietario es impropable que sean soportados.

source: Network socket support is disabled for BeOS R5 net server.
es_es: Soporte para socket está desactivado para BeOS R5 net server.

source: See also:
es_es: Vea también:

source: 78/75813 subtests failed, 99.90% okay.
es_es: 78/75813 subtests fallaron, 99.90% bien.

source: See L<open>.
es_es: Ver L<open>.

source: A nice place to ask questions is the PerlMonks site, http://www.perlmonks.org/ , or the Perl Beginners mailing list http://lists.perl.org/showlist.cgi?name=beginners .
es_es: Un buen lugar para hacer preguntas es el sitio de PerlMonks, http://www.perlmonks.org/ , o la lista de correo para principiantes, http://lists.perl.org/showlist.cgi?name=beginners .

source: =head2 What was Ponie?
es_es: =head2 ¿Qué era Ponie?

source: See L<perlop> for more details on unary operators and the comma operator.
es_es: Ver L<perlop> para más detalles en operadores unarios y el operador coma.

source: \x{}, \x00 character whose ordinal is the given hexadecimal number
es_es: \x{}, \x00 carácter cuyo ordinal es el número hex indicado

source: =head2 About Compiler Versions of Irix
es_es: =head2 Sobre las versiones del compilador de Irix

source: See also the C<Time::Local> module (for converting seconds, minutes, hours, and such back to the integer value returned by time()), and the L<POSIX> module's strftime(3) and mktime(3) functions.
es_es: Vea también el módulo C<Time::Local> (para convertir los segundos, minutos, horas, etc, de nuevo al valor entero devuelto por time()), y las funciones strftime(3) y mktime(3) del módulo L<POSIX>.

source: =head2 Unpacking Perl Distribution on VM/ESA
es_es: =head2 Desempaquetando distribuciones Perl en VM/ESA

source: Hash Hash hash keys identical (every key is found in both hashes)
es_es: Hash Hash claves hash identicas (cada clave está en ambos hash)

source: =item More complex regular expressions
es_es: =item Expresiones regulares más complejas

source: However, if warnings are enabled, a warning of the C<printf> warning class is issued on an unsupported conversion flag.
es_es: Sin embargo, si las advertencias están habilitadas, una advertencia de la clase C<printf> es emitida cuando no esté soportada una bandera de conversión.

source: Tidies a pod file.
es_es: Ordena un archivo pod.

source: print "$abbr[$mon] $mday";
es_es: print "$abbr[$mes] $mdia";

source: Instead of using C<given()>, you can use a C<foreach()> loop.
es_es: En lugar de usar C<given()>, puede usar un bucle C<foreach()>.

source: You could just make a direct assignment if you knew where you wanted to put it:
es_es: Puede hacer una asignación directa si sabe dónde quiere ponerlo:

source: document the coderef-in-@INC feature
es_es: documentar la característica "referencia a código" en @INC

source: As a special case, specifying a PATTERN of space (S<C<' '>>) will split on white space just as C<split> with no arguments does.
es_es: Como caso especial, especificando un PATRÓN de un espacio (S<C<' '>>) dividirá en espacios en blanco al igual que lo hace C<split> sin argumentos.

source: The C<$*> Variable Will Be Removed (it was deprecated a long time ago)
es_es: La variable C<$*> será eliminada (que estaba en desuso desde hace mucho tiempo)

source: accompany the distribution with the machine-readable source of the Package with your modifications.
es_es: acompañar a la distribución con el código fuente, legible por la máquina, del Paquete con sus modificaciones.

source: The copy of the Unicode Character Database included in Perl 5.8 has been updated to 4.0.0 from 3.2.0.
es_es: La copia de la base de datos de caracteres Unicode incluidos en Perl 5.8 ha sido actualizado desde la 3.2.0 a la 4.0.0.

source: Upgraded from version 2.64 to 3.17.
es_es: Actualizado desde la versión 2.64 a la 3.17.

source: $foo = @foo; # $foo gets 3
es_es: $foo = @foo; # $foo vale 3

source: perl5133delta Perl changes in version 5.13.3
es_es: perl5133delta Cambios en la versión 5.13.3

source: B<WARNING>: Any files opened at the time of the dump will I<not> be open any more when the program is reincarnated, with possible resulting confusion by Perl.
es_es: B<ATENCIÓN>: Cualquier archivo abierto en el momento del volcado I<no> será abierto mas que cuando el programa sea reencarnado, con una muy posible confusión por parte de Perl.

source: Copy the miniperl executable from the native build done earlier to replace the cross compiled miniperl.
es_es: Copie el ejecutable miniperl desde la construcción nativa hecha antes, para reemplazar el miniperl compilado de forma cruzada.

source: You can--but shouldn't--omit the mode in these forms when that mode is C<< < >>.
es_es: Puede -pero no debe- omitir el modo en estos formatos cuando ese modo sea C<< < >>.

source: C<syslog()> can now use numeric constants for facility names and priorities, in addition to strings.
es_es: C<syslog()> ahora puede utilizar constantes numéricas para los nombres de las facilidades y las prioridades, además de cadenas normales.

source: # alter $@ on nefarious repugnancy only
es_es: # altera $@ solo en una infame repugnancia

source: The granularity for such extension or truncation is one or more bytes.
es_es: La granularidad para dicha extensión o truncamiento es de uno o más bytes.

source: The result is the Unicode character or character sequence given by I<name>.
es_es: El resulado es un carácter o secuencias de caracteres Unicode indicado por I<nombre>.

source: CORE::require() and CORE::do() were always parsed as require() and do() when they were overridden.
es_es: CORE::require() y CORE::do() eran siempre interpretadas como require() y do() cuando eran sobreescritas.

source: If you call it again after this, it will assume you are processing another @ARGV list, and if you haven't set @ARGV, will read input from STDIN.
es_es: Si lo llama de nuevo, después, asumirá que está procesando otra lista @ARGV, y si no ha configurado @ARGV, leerá la entrada desde STDIN.

source: =head2 Smaller fixes
es_es: =head2 Correcciones menores

source: this port does support dynamic loading but it's not had much testing
es_es: esta adaptación tiene soporte para carga dinámica, pero no ha sido muy testado

source: On most systems the epoch is 00:00:00 UTC, January 1, 1970; a prominent exception being Mac OS Classic which uses 00:00:00, January 1, 1904 in the current local time zone for its epoch.
es_es: En la mayoría de los sistemas el I<epoch> son las 00:00:00 UTC, del 1 de enero de 1970; una prominente excepción es el Mac OS Classic que utiliza las 00:00:00, del 1 de enero de 1904 en la actual zona horaria.

source: If SUBNAME is specified, it gives the name of a subroutine that returns an integer less than, equal to, or greater than C<0>, depending on how the elements of the list are to be ordered.
es_es: Si se ha especificado NOMBRE_SUB, da el nombre de la subrutina que devuelve un entero menor que, igual que, o mayor que C<0>, dependiendo de cómo los elementos de la lista tienen que ser ordenados.

source: C<Test::Harness> upgraded to version 2.56 (was 2.48)
es_es: C<Test::Harness> actualizado a la versión 2.56 (era 2.48)

source: See the answer to "Where can I buy a commercial version of perl?" for more information.
es_es: Vea la respuesta a la pregunta "¿Dónde puedo adquirir una versión comercial de Perl?" para obtener más información.

source: On most systems, this will set the file's access and modification times to the current time (i.e., equivalent to the example above) and will work even on files you don't own provided you have write permission:
es_es: En la mayoría de los sistemas, esto hará que los tiempos de acceso y modificación del archivo se establezcan a la hora actual (es decir, equivalente al ejemplo anterior) y funcionará incluso en archivos de los cuales usted no tenga permisos de escritura:

source: means to use the current locale's rules (see L<perllocale>) when pattern matching.
es_es: significa que hay que usar las reglas regionales actuales (vea L<perllocale>) en la coincidencia de patrones.

source: See L</"I/O Operators"> for more discussion.
es_es: Vea L</"Operadores E/S"> para más discusiones.

source: When your module encounters an error it should do one or more of:
es_es: Cuando el módulo se encuentre con un error debe hacer uno o más de:

source: printf '<%+.6d>', 1; # prints "<+000001>"
es_es: printf '<%+.6d>', 1; # imprime "<+000001>"
